ANSI-Common-LISP/docs/exercise-7.md


# exercise-7

1.  [Define a function that takes&#x2026;](#org983d5cd)
2.  [Define a function that takes&#x2026;](#orgca4cd42)
3.  [Suppose that in some format&#x2026;](#org5f9c3b2)
4.  [Define a function that takes&#x2026;](#org7ebe495)
5.  [Modify `stream-subst` to allow&#x2026;](#org185b9ae)
6.  [Modify `stream-subst` so that&#x2026;](#orga3fe3b5)


<a id="org983d5cd"></a>

## Define a function that takes&#x2026;

1.Define a function that takes a filename and returns a list of strings representing each line in the file.


<a id="orgca4cd42"></a>

## Define a function that takes&#x2026;

2.Define a function that takes a filename and returns a list of the expres-sions in the file.


<a id="org5f9c3b2"></a>

## Suppose that in some format&#x2026;

3.Suppose that in some format for text files, comments are indicated by `a%` character. Everything from this character to the end of the line is ignored. Define a function that takes two filenames, and writes to the second file a copy of the first, minus comments.


<a id="org7ebe495"></a>

## Define a function that takes&#x2026;

4.Define a function that takes a two-dimensional array of floats and displays it in neat columns. Each element should be printed with two digits after the decimal point, in a field 10 characters wide. (Assume all will fit.) You will need `array-dimensions` (page 361).


<a id="org185b9ae"></a>

## Modify `stream-subst` to allow&#x2026;

5.Modify `stream-subst` to allow wildcards in the pattern. If the character + occurs in `old`, it should match any input character.


<a id="orga3fe3b5"></a>

## Modify `stream-subst` so that&#x2026;

6.Modify `stream-subst` so that the pattern can include an element that matches any digit character, an element that matches any alphanumeric character, or an element that matches any character. The pattern must also be able to match any specific input character. (Hint: `old` can no longer be a string.)

